In [129]:
import random

random.seed(42)

import pandas as pd

In [130]:
data = {
    "Country": [
        "USA", "USA", "UK", "Canada", "India", "USA", "France", "India",
        "UK", "Germany", "Canada", "France", "Australia", "India", "UK",
        "France", "Australia", "Germany", "Canada", "Australia"
    ],
    "Price": [random.randint(500, 1500) for _ in range(20)]
}

In [131]:
df = pd.DataFrame(data)

In [132]:
df.head()

  Country  Price
0     USA   1154
1     USA    614
2      UK    525
3  Canada   1259
4   India    781

In [133]:
mean_price = df.groupby("Country")["Price"].mean().round(decimals=2).to_dict()

In [134]:
mean_price

{'Australia': 980.0,
 'Canada': 993.67,
 'France': 1030.0,
 'Germany': 568.0,
 'India': 827.0,
 'UK': 789.33,
 'USA': 839.33}

In [ ]:
df["Price_Encoded"] = df)

In [136]:
df

      Country  Price  Price_Encoded
0         USA   1154         839.33
1         USA    614         839.33
2          UK    525         789.33
3      Canada   1259         993.67
4       India    781         827.00
5         USA    750         839.33
6      France    728        1030.00
7       India    642         827.00
8          UK   1254         789.33
9     Germany    604         568.00
10     Canada   1192         993.67
11     France   1258        1030.00
12  Australia   1413         980.00
13      India   1058         827.00
14         UK    589         789.33
15     France   1104        1030.00
16  Australia    932         980.00
17    Germany    532         568.00
18     Canada    530         993.67
19  Australia    595         980.00